AccumulationRegisters/КорректировкиНУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>КорректировкиНУ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>удалитьДоходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/НалоговыйУчет/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СформироватьДвиженияКорректировкаНУ(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Проводки = Движения.Найти("Хозрасчетный");
	ТаблицаРеквизиты = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРеквизиты;
	
	Параметры = ПодготовитьПараметрыСписаниеОС(ТаблицаРеквизиты);
	Реквизиты = Параметры.Реквизиты[0];

	Если Не ЗначениеЗаполнено(Проводки) 
		Или Не ЗначениеЗаполнено(ТаблицаРеквизиты) Тогда
		Возврат;
	КонецЕсли;	
	
	// Список временных счетов.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК Счет
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Временный";
	МассивВременныеСчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Счет");
	
	Для Каждого Проводка Из Проводки Цикл
		
		// Корректировка по счету Дт.
		Если Проводка.КорректироватьНУ 
			И НЕ МассивВременныеСчета.Найти(Проводка.СчетДт) = Неопределено Тогда 
			Запись = Движения.КорректировкиНУ.Добавить();
			Запись.Период = Реквизиты.Период;
			Запись.Организация = Реквизиты.Организация;
			Запись.Счет = Проводка.СчетДт;
			Запись.ВидУчета = Перечисления.ВидыУчета.ВР;
			Запись.Сумма = Проводка.Сумма;
		КонецЕсли;	
		
		// Корректировка по счету Кт.
		Если Проводка.КорректироватьНУ И 
			НЕ МассивВременныеСчета.Найти(Проводка.СчетКт) = Неопределено Тогда 
			Запись = Движения.КорректировкиНУ.Добавить();
			Запись.Период = Реквизиты.Период;
			Запись.Организация = Реквизиты.Организация;
			Запись.Счет = Проводка.СчетКт;
			Запись.ВидУчета = Перечисления.ВидыУчета.ВР;
			Запись.Сумма = Проводка.Сумма;
		КонецЕсли;	
	КонецЦикла;

	Движения.КорректировкиНУ.Записывать = Истина;
	
КонецПроцедуры

Функция ПодготовитьПараметрыСписаниеОС(ТаблицаРеквизиты)

	Параметры = Новый Структура;

	// Подготовка таблицы Параметры.Реквизиты
	СписокОбязательныхКолонок = ""
	+ "Регистратор,"	// <ДокументСсылка.*> - документ-регистратор движений
	+ "Период,"			// <Дата> - период движений - дата документа
	+ "Организация";	// <СправочникСсылка.Организации>

	Параметры.Вставить("Реквизиты",
		ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

#КонецОбласти
